#### Terraform Format and Style 🖌 `failure`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloud_sql.google_project_service.servicenetworking will be created
  + resource "google_project_service" "servicenetworking" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "infra-480802"
      + service            = "servicenetworking.googleapis.com"
    }

  # module.cloud_sql.google_service_networking_connection.private_vpc_connection will be created
  + resource "google_service_networking_connection" "private_vpc_connection" {
      + id                      = (known after apply)
      + network                 = "projects/infra-480802/global/networks/default"
      + peering                 = (known after apply)
      + reserved_peering_ranges = [
          + "prod-cloudsql-private-ip",
        ]
      + service                 = "servicenetworking.googleapis.com"
    }

  # module.cloud_sql.google_sql_database.ojeomneo will be created
  + resource "google_sql_database" "ojeomneo" {
      + charset         = "UTF8"
      + collation       = "en_US.UTF8"
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "prod-woohalabs-cloudsql"
      + name            = (sensitive value)
      + project         = "infra-480802"
      + self_link       = (known after apply)
    }

  # module.cloud_sql.google_sql_database.reviewmaps will be created
  + resource "google_sql_database" "reviewmaps" {
      + charset         = "UTF8"
      + collation       = "en_US.UTF8"
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "prod-woohalabs-cloudsql"
      + name            = (sensitive value)
      + project         = "infra-480802"
      + self_link       = (known after apply)
    }

  # module.cloud_sql.google_sql_database_instance.main will be created
  + resource "google_sql_database_instance" "main" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_15"
      + deletion_protection            = true
      + dns_name                       = (known after apply)
      + dns_names                      = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "prod-woohalabs-cloudsql"
      + node_count                     = (known after apply)
      + private_ip_address             = (known after apply)
      + project                        = "infra-480802"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "asia-northeast3"
      + replica_names                  = (known after apply)
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + settings {
          + activation_policy           = "ALWAYS"
          + availability_type           = "ZONAL"
          + connector_enforcement       = (known after apply)
          + disk_autoresize             = true
          + disk_autoresize_limit       = 0
          + disk_size                   = 20
          + disk_type                   = "PD_SSD"
          + edition                     = (known after apply)
          + effective_availability_type = (known after apply)
          + pricing_plan                = "PER_USE"
          + tier                        = "db-g1-small"
          + user_labels                 = (known after apply)
          + version                     = (known after apply)

          + backup_configuration {
              + enabled                        = false
              + point_in_time_recovery_enabled = false
              + start_time                     = (known after apply)
              + transaction_log_retention_days = (known after apply)
            }

          + database_flags {
              + name  = "effective_cache_size"
              + value = "98304"
            }
          + database_flags {
              + name  = "max_connections"
              + value = "100"
            }
          + database_flags {
              + name  = "shared_buffers"
              + value = "32768"
            }
          + database_flags {
              + name  = "work_mem"
              + value = "4096"
            }

          + ip_configuration {
              + enable_private_path_for_google_cloud_services = true
              + ipv4_enabled                                  = false
              + private_network                               = "projects/infra-480802/global/networks/default"
              + server_ca_mode                                = (known after apply)
              + ssl_mode                                      = (known after apply)
            }

          + maintenance_window {
              + day          = 7
              + hour         = 3
              + update_track = "stable"
            }
        }
    }

  # module.cloud_sql.google_sql_user.ojeomneo will be created
  + resource "google_sql_user" "ojeomneo" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "prod-woohalabs-cloudsql"
      + name                    = (sensitive value)
      + password                = (sensitive value)
      + project                 = "infra-480802"
      + sql_server_user_details = (known after apply)
    }

  # module.cloud_sql.google_sql_user.reviewmaps will be created
  + resource "google_sql_user" "reviewmaps" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "prod-woohalabs-cloudsql"
      + name                    = (sensitive value)
      + password                = (sensitive value)
      + project                 = "infra-480802"
      + sql_server_user_details = (known after apply)
    }

  # module.cloud_sql.null_resource.enable_pgcrypto will be created
  + resource "null_resource" "enable_pgcrypto" {
      + id = (known after apply)
    }

  # module.cloud_sql.null_resource.enable_postgis will be created
  + resource "null_resource" "enable_postgis" {
      + id = (known after apply)
    }

  # module.cloud_sql.null_resource.ojeomneo_ownership will be created
  + resource "null_resource" "ojeomneo_ownership" {
      + id = (known after apply)
    }

  # module.cloud_sql.null_resource.reviewmaps_ownership will be created
  + resource "null_resource" "reviewmaps_ownership" {
      + id = (known after apply)
    }

  # module.cloud_sql.null_resource.update_ojeomneo_secret will be created
  + resource "null_resource" "update_ojeomneo_secret" {
      + id = (known after apply)
    }

  # module.cloud_sql.null_resource.update_reviewmaps_secret will be created
  + resource "null_resource" "update_reviewmaps_secret" {
      + id = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

```

</details>

---

**To apply this plan, comment:**
- `apply` or `ok` or `terraform apply`

*Pusher: @ggorockee, Action: `pull_request`, Workflow: `GCP Terraform Plan`*